Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/edc/ATSAMS70Q19B.PIC
      <edc:AdjustPoint edc:_addr="0x4007C03C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x4007C040" edc:access="------------------------------nn" edc:cname="QSPI_SMR" edc:nzwidth="0x20" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SCREN" edc:desc="Scrambling/Unscrambling Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The scrambling/unscrambling is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The scrambling/unscrambling is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RVDIS" edc:desc="Scrambling/Unscrambling Random Value Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4007C044" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="QSPI_SKR" edc:nzwidth="0x20" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="USRK" edc:desc="Scrambling User Key" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4007C048" edc:offset="0x9C"/>
      <edc:SFRDef edc:_addr="0x4007C0E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="QSPI_WPMR" edc:nzwidth="0x20" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x515350"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4007C0E8" edc:access="----------------rrrrrrrr-------r" edc:cname="QSPI_WPSR" edc:nzwidth="0x20" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4007C0EC" edc:offset="0x3F94"/>
      <edc:SFRDef edc:_addr="0x40080080" edc:access="--------------------nnnn-------n" edc:cname="SMC_OCMS" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SMSE" edc:desc="Static Memory Controller Scrambling Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="CS0SE" edc:desc="Chip Select 0 Scrambling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CS1SE" edc:desc="Chip Select 1 Scrambling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CS2SE" edc:desc="Chip Select 2 Scrambling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CS3SE" edc:desc="Chip Select 3 Scrambling Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40080084" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="SMC_KEY1" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="KEY1" edc:desc="Off Chip Memory Scrambling (OCMS) Key Part 1" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40080088" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="SMC_KEY2" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="KEY2" edc:desc="Off Chip Memory Scrambling (OCMS) Key Part 2" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4008008C" edc:offset="0x58"/>
      <edc:SFRDef edc:_addr="0x400800E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="SMC_WPMR" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protect Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x534D43"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400800E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="SMC_WPSR" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400800EC" edc:offset="0x3F14"/>
      <edc:SFRDef edc:_addr="0x40084000" edc:access="-----------------------------nnn" edc:cname="SDRAMC_MR" edc:nzwidth="0x20" ltx:memberofperipheral="SDRAMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="SDRAMC Command Mode" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode. Any access to the SDRAM is decoded normally. To activate this mode, command must be followed by a write to the SDRAM." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="NOP" edc:desc="The SDRAMC issues a NOP command when the SDRAM device is accessed regardless of the cycle. To activate this mode, command must be followed by a write to the SDRAM." edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ALLBANKS_PRECHARGE" edc:desc="The SDRAMC issues an &quot;All Banks Precharge&quot; command when the SDRAM device is accessed regardless of the cycle. To activate this mode, command must be followed by a write to the SDRAM." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="LOAD_MODEREG" edc:desc="The SDRAMC issues a &quot;Load Mode Register&quot; command when the SDRAM device is accessed regardless of the cycle. To activate this mode, command must be followed by a write to the SDRAM." edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="AUTO_REFRESH" edc:desc="The SDRAMC issues an &quot;Auto-Refresh&quot; Command when the SDRAM device is accessed regardless of the cycle. Previously, an &quot;All Banks Precharge&quot; command must be issued. To activate this mode, command must be followed by a write to the SDRAM." edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="EXT_LOAD_MODEREG" edc:desc="The SDRAMC issues an &quot;Extended Load Mode Register&quot; command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the &quot;Extended Load Mode Register&quot; command must be followed by a write to the SDRAM. The write in the SDRAM must be done in the appropriate bank; most low-power SDRAM devices use the bank 1." edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DEEP_POWERDOWN" edc:desc="Deep power-down mode. Enters deep power-down mode." edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40084004" edc:access="--------------------nnnnnnnnnnnn" edc:cname="SDRAMC_TR" edc:nzwidth="0x20" ltx:memberofperipheral="SDRAMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="SDRAMC Refresh Timer Count" edc:nzwidth="0xC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40084008" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SDRAMC_CR" edc:nzwidth="0x20" ltx:memberofperipheral="SDRAMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NC" edc:desc="Number of Column Bits" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="COL8" edc:desc="8 column bits" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="COL9" edc:desc="9 column bits" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="COL10" edc:desc="10 column bits" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="COL11" edc:desc="11 column bits" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NR" edc:desc="Number of Row Bits" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="ROW11" edc:desc="11 row bits" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ROW12" edc:desc="12 row bits" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ROW13" edc:desc="13 row bits" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NB" edc:desc="Number of Banks" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="2 banks" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="BANK4" edc:desc="4 banks" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CAS" edc:desc="CAS Latency" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="LATENCY1" edc:desc="1 cycle CAS latency" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="LATENCY2" edc:desc="2 cycle CAS latency" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="LATENCY3" edc:desc="3 cycle CAS latency" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DBW" edc:desc="Data Bus Width" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TWR" edc:desc="Write Recovery Delay" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="TRC_TRFC" edc:desc="Row Cycle Delay and Row Refresh Cycle" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="TRP" edc:desc="Row Precharge Delay" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="TRCD" edc:desc="Row to Column Delay" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="TRAS" edc:desc="Active to Precharge Delay" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="TXSR" edc:desc="Exit Self Refresh to Active Delay" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4008400C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40084010" edc:access="------------------nnnnnn-nnn--nn" edc:cname="SDRAMC_LPR" edc:nzwidth="0x20" ltx:memberofperipheral="SDRAMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LPCB" edc:desc="Low-power Configuration Bits" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Low Power Feature is inhibited: no Power-down, Self-refresh or Deep Power-down command is issued to the SDRAM device." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SELF_REFRESH" edc:desc="The SDRAMC issues a Self-refresh command to the SDRAM device, the SDCK clock is deactivated and the SDCKE signal is set low. The SDRAM device leaves the Self Refresh Mode when accessed and enters it after the access." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="POWER_DOWN" edc:desc="The SDRAMC issues a Power-down Command to the SDRAM device after each access, the SDCKE signal is set to low. The SDRAM device leaves the Power-down Mode when accessed and enters it after the access." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DEEP_POWER_DOWN" edc:desc="The SDRAMC issues a Deep Power-down command to the SDRAM device. This mode is unique to low-power SDRAM." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PASR" edc:desc="Partial Array Self-refresh (only for low-power SDRAM)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TCSR" edc:desc="Temperature Compensated Self-Refresh (only for low-power SDRAM)" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="DS" edc:desc="Drive Strength (only for low-power SDRAM)" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time to Define When Low-power Mode Is Enabled" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="LP_LAST_XFER" edc:desc="The SDRAMC activates the SDRAM low-power mode immediately after the end of the last transfer." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LP_LAST_XFER_64" edc:desc="The SDRAMC activates the SDRAM low-power mode 64 clock cycles after the end of the last transfer." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="LP_LAST_XFER_128" edc:desc="The SDRAMC activates the SDRAM low-power mode 128 clock cycles after the end of the last transfer." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40084014" edc:access="-------------------------------w" edc:cname="SDRAMC_IER" edc:nzwidth="0x20" ltx:memberofperipheral="SDRAMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RES" edc:desc="Refresh Error Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40084018" edc:access="-------------------------------w" edc:cname="SDRAMC_IDR" edc:nzwidth="0x20" ltx:memberofperipheral="SDRAMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RES" edc:desc="Refresh Error Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4008401C" edc:access="-------------------------------r" edc:cname="SDRAMC_IMR" edc:nzwidth="0x20" ltx:memberofperipheral="SDRAMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RES" edc:desc="Refresh Error Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40084020" edc:access="-------------------------------r" edc:cname="SDRAMC_ISR" edc:nzwidth="0x20" ltx:memberofperipheral="SDRAMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RES" edc:desc="Refresh Error Status (cleared on read)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40084024" edc:access="------------------------------nn" edc:cname="SDRAMC_MDR" edc:nzwidth="0x20" ltx:memberofperipheral="SDRAMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MD" edc:desc="Memory Device Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SDRAM" edc:desc="SDRAM" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LPSDRAM" edc:desc="Low-power SDRAM" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
