Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/edc/ATSAMS70Q19B.PIC
      <edc:AdjustPoint edc:_addr="0xE000EDA4" edc:offset="0x15C"/>
      <edc:SFRDef edc:_addr="0xE000EF00" edc:access="-----------------------nnnnnnnnn" edc:cname="NVICSTIR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INTID" edc:desc="Interrupt ID of the interrupt to trigger, in the range 0-239. For example, a value of 0x03 specifies interrupt IRQ3." edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000EF04" edc:offset="0x30"/>
      <edc:SFRDef edc:_addr="0xE000EF34" edc:access="nn---------------------n-nnnn-nn" edc:cname="FPCCR" edc:mclr="11000000000000000000000000000000" edc:nzwidth="0x20" edc:por="11000000000000000000000000000000" ltx:memberofperipheral="FPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LSPACT" edc:desc="Lazy state preservation is active. Floating-point stack frame has been allocated but saving state to it has been deferred." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER" edc:desc="Privilege level was user when the floating-point stack frame was allocated." edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="THREAD" edc:desc="Mode was Thread Mode when the floating-point stack frame was allocated." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HFRDY" edc:desc="Priority permitted setting the HardFault handler to the pending state when the floating-point stack frame was allocated." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MMRDY" edc:desc="MemManage is enabled and priority permitted setting the MemManage handler to the pending state when the floating-point stack frame was allocated." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BFRDY" edc:desc="BusFault is enabled and priority permitted setting the BusFault handler to the pending state when the floating-point stack frame was allocated." edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MONRDY" edc:desc="DebugMonitor is enabled and priority permits setting MON_PEND when the floating-point stack frame was allocated." edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x15"/>
            <edc:SFRFieldDef edc:cname="LSPEN" edc:desc="Enable automatic lazy state preservation for floating-point context." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ASPEN" edc:desc="Enables CONTROL.FPCA setting on execution of a floating-point instruction. This results in automatic hardware state preservation and restoration, for floating-point context, on exception entry and exit." edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EF38" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnn---" edc:cname="FPCAR" edc:nzwidth="0x20" ltx:memberofperipheral="FPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ADDRESS" edc:desc="The location of the unpopulated floating-point register space allocated on an exception stack frame." edc:nzwidth="0x1D"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EF3C" edc:access="-----nnnnn----------------------" edc:cname="FPDSCR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="FPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x16"/>
            <edc:SFRFieldDef edc:cname="RMode" edc:desc="Default value for FPSCR.RMode." edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FZ" edc:desc="Default value for FPSCR.FZ." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DN" edc:desc="Default value for FPSCR.DN." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AHP" edc:desc="Default value for FPSCR.AHP." edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SQIDataSector edc:beginaddr="0x80000000" edc:endaddr="0xA0000000" edc:regionid="QSPIMEM"/>
    <edc:CodeSector edc:beginaddr="0x0" edc:endaddr="0x200000" edc:regionid="ITCM"/>
    <edc:CodeSector edc:beginaddr="0x400000" edc:endaddr="0x480000" edc:regionid="IFLASH"/>
    <edc:BootConfigSector edc:beginaddr="0x800000" edc:endaddr="0x804000" edc:regionid="IROM"/>
    <edc:GPRDataSector edc:beginaddr="0x20000000" edc:endaddr="0x20020000" edc:regionid="DTCM"/>
    <edc:GPRDataSector edc:beginaddr="0x20400000" edc:endaddr="0x20440000" edc:regionid="IRAM"/>
    <edc:EBIDataSector edc:beginaddr="0x60000000" edc:endaddr="0x61000000" edc:regionid="EBI_CS0"/>
    <edc:EBIDataSector edc:beginaddr="0x61000000" edc:endaddr="0x62000000" edc:regionid="EBI_CS1"/>
    <edc:EBIDataSector edc:beginaddr="0x62000000" edc:endaddr="0x63000000" edc:regionid="EBI_CS2"/>
    <edc:EBIDataSector edc:beginaddr="0x63000000" edc:endaddr="0x64000000" edc:regionid="EBI_CS3"/>
    <edc:DDRSector edc:beginaddr="0x70000000" edc:endaddr="0x80000000" edc:regionid="SDRAM_CS"/>
    <edc:DeviceIDSector edc:beginaddr="0x400E0940" edc:endaddr="0x400E0944" edc:mask="0xFFFFFFE0" edc:regionid="devid" edc:value="0xA11D0A01"/>
  </edc:PhysicalSpace>
  <edc:FusesSpace edc:magicoffset="0xD0000000">
    <edc:ConfigFuseSector edc:beginaddr="0x0" edc:endaddr="0x4" edc:regionid="fuses">
      <edc:DCRDef edc:_addr="0x0" edc:access="-------nn-----nn" edc:cname="GPNVMBITS" edc:factorydefault="0x0" edc:impl="0x183" edc:nzwidth="0x10" edc:unused="0x0" edc:useinchecksum="0xFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SECURITY_BIT" edc:desc="Security Bit" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="BOOT_MODE" edc:desc="Boot Mode Selection" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:DCRFieldDef edc:cname="TCM_CONFIGURATION" edc:desc="TCM Configuration" edc:nzwidth="0x2"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:FusesSpace>
  <edc:LockbitsSpace edc:magicoffset="0xD0000004">
    <edc:ConfigFuseSector edc:beginaddr="0x0" edc:endaddr="0x4" edc:regionid="lockbits">
      <edc:DCRDef edc:_addr="0x0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LOCKBIT_WORD0" edc:factorydefault="0x0" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="LOCKBIT">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="LOCK_REGION_0" edc:desc="Lock Region 0" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_1" edc:desc="Lock Region 1" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_2" edc:desc="Lock Region 2" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_3" edc:desc="Lock Region 3" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_4" edc:desc="Lock Region 4" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_5" edc:desc="Lock Region 5" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_6" edc:desc="Lock Region 6" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_7" edc:desc="Lock Region 7" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_8" edc:desc="Lock Region 8" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_9" edc:desc="Lock Region 9" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_10" edc:desc="Lock Region 10" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_11" edc:desc="Lock Region 11" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_12" edc:desc="Lock Region 12" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_13" edc:desc="Lock Region 13" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_14" edc:desc="Lock Region 14" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_15" edc:desc="Lock Region 15" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_16" edc:desc="Lock Region 16" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_17" edc:desc="Lock Region 17" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_18" edc:desc="Lock Region 18" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_19" edc:desc="Lock Region 19" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_20" edc:desc="Lock Region 20" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_21" edc:desc="Lock Region 21" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_22" edc:desc="Lock Region 22" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_23" edc:desc="Lock Region 23" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_24" edc:desc="Lock Region 24" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_25" edc:desc="Lock Region 25" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_26" edc:desc="Lock Region 26" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_27" edc:desc="Lock Region 27" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_28" edc:desc="Lock Region 28" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_29" edc:desc="Lock Region 29" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_30" edc:desc="Lock Region 30" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_31" edc:desc="Lock Region 31" edc:nzwidth="0x1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:LockbitsSpace>
  <edc:PinList edc:ppsflavor="atmel">
    <edc:Pin>
      <edc:VirtualPin edc:name="PE1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D9" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D9" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D9" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB9" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="DO0" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB9" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB8" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="HSDP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DSR0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA29" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="RI1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK2" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC21" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="DSR2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC20" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA30" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMEXTRG0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCDA0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DO0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="RXD2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NWR1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="NBS1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="NWR1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="NBS1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="NWR1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="NBS1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TWD1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TXD1" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D10" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D10" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D10" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK9" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="DI0" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SCK0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DAC0" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDUTMIC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="HSDM"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DTR0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC24" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SPCK" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD4" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="RI0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="RI2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC18" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NBS0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NBS0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NBS0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="JTAGSEL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC17" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A22" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDCLE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A22" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDCLE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A22" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDCLE" edc:ppsfunction="A"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D8" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D8" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D8" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA9" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="WS" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD11" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDOUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VBG"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC25" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS0" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC23" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA3" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC22" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A4" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A4" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A4" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NPCS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCDA1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA28" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="DSR1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCCDA" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PWMFI2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TWCK1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A17" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="BA1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A17" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="BA1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A17" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="BA1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="MCK" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ADVREFP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ADVREFN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QIO3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="UTXD3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D11" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DCD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="DAC1" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDANA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="DCD2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="DTR2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC19" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD9" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMFI2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="ADTRG" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD29" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SDWE" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="SDWE" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="SDWE" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC16" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A21" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDALE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A21" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDALE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A21" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDALE" edc:ppsfunction="A"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A18" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A18" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A18" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="CK" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A13" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A13" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A13" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK5" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AD6" edc:ppsfunction="X1"/>
    </edc:Pin>
